dewayne57/PIC18F__Q43/03 I2C/I2C 02 Module Host/i2c.c
    // If the clock source is the system oscillator (FOSC), the system clock / 4 (FOSC/4), or the
    // Hight Frequency Internal Oscillator (HFINTOSC), we will set the I2C fast mode.  Otherwise
    // we will leave it in normal mode.
    bool fastMode = false;
    if (clockSource == I2C_CLOCK_FOSC || clockSource == I2C_CLOCK_FOSC_DIV_4 ||
        clockSource == I2C_CLOCK_HFINTOSC)
    {
        fastMode = true; // Set the fast mode flag
    }

    CRITICAL_SECTION_START();
    I2C1CON0 = 0;                              // Reset I2C1 control register
    I2C1CON0bits.MODE = (uint8_t)handle->mode; // Set the I2C mode (master/slave)
    I2C1CON1 = 0;                              // Reset I2C1 control register
    I2C1CON2 = 0;                              // Reset I2C1 control register
    I2C1CON2bits.FME = fastMode ? 1 : 0;       // Set the I2C fast mode bit
    I2C1CLK = (uint8_t)handle->clockSource;    // Set the I2C clock source
    I2C1PIE = 0;                               // Disable I2C1 condition interrupts
    I2C1ERRbits.BTOIE = 1;                     // Enable I2C1 bus timeout interrupt
    I2C1ERRbits.BCLIE = 1;                     // Enable I2C1 bus collision interrupt
    I2C1ERRbits.NACKIE = 1;                    // Enable I2C1 NACK interrupt
    I2C1PIE = 0;                               // Disable I2C1 general interrupts
    I2C1PIEbits.CNTIE = 1;                     // Enable I2C1 count interrupt
    I2C1PIR = 0;                               // Clear I2C1 interrupt flags
    I2C1ERR = 0;                               // Clear I2C1 error flags
    I2C1CNT = 0;                               // Reset I2C1 count register
    if (handle->timeoutSource != NONE)
    {
        // Set the I2C1 bus timeout register to the specified timeout value
        I2C1BTO = (uint8_t)handle->timeout;
    }

    // Ensure I2C transfer pacing can preempt low-priority ISRs that may
    // initiate I2C operations (for example INT1 handler).
    IPR7bits.I2C1EIP = 1;
    IPR7bits.I2C1IP = 1;
    IPR7bits.I2C1TXIP = 1;
    IPR7bits.I2C1RXIP = 1;

    PIE7bits.I2C1EIE = 1;  // Enable I2C1 Error Interrupt Enable
    PIE7bits.I2C1TXIE = 1; // Enable I2C1 Transmit Interrupt Enable
    PIE7bits.I2C1RXIE = 1; // Enable I2C1 Receive Interrupt Enable
    PIE7bits.I2C1IE = 1;   // Enable I2C1 General Interrupt Enable
    CRITICAL_SECTION_END();

    I2C1CON0bits.EN = 1;         // Enable the channel
    __delay_ms(1);               // Short delay to let the module come up
    handle->initialized = true;  // Mark the handle as initialized
    handle->lastStatus = I2C_OK; // Set the last state to OK
    return I2C_OK;               // Return success status
}

/// @brief Write data to an I2C device.
/// @param handle Pointer to the I2C handle structure.
I2C_Status_t I2C_Write(I2C_Handle_t* handle, uint16_t deviceAddress, uint8_t* data, uint16_t length)
{
    if (!isHandleValid(handle))
    {
        return I2C_INVALID_HANDLE; // Return an error code indicating that the handle is invalid
    }
    I2C_Status_t status = I2C_OK;
    if ((status = I2C_IsBusy(handle)) != I2C_OK)
    {
        return status;
    }
    if (length <= 0)
    {
        handle->lastStatus = I2C_INVALID_LENGTH; // Set the last state to invalid length
        return I2C_INVALID_LENGTH; // Return an error code indicating that the length is invalid
    }
    cacheHandle(handle);
    handle->activeDeviceAddress = deviceAddress;

    handle->txBuffer = data;       // Set the transmit buffer pointer
    handle->txBufferSize = length; // Set the transmit buffer size
    handle->txBufferIndex = 0;     // Reset the transmit buffer index

    setupDeviceAddress(handle, deviceAddress, false); // Setup the device address
    PIE7bits.I2C1RXIE = 0;                            // TX transfer only
    PIE7bits.I2C1TXIE = 1;                            // Enable the transmit interrupt
    handle->state = I2C_WRITE;                        // Set the I2C bus state to write mode
    I2C1CNT = (uint8_t)length; // Set the I2C count register to the number of bytes to transmit
    I2C1CON0bits.RSEN = 0;     // Disable repeated start condition
    I2C1CON0bits.CSTR = 0;     // Release clock stretching before starting the transfer
    I2C1CON0bits.S = 1;        // Generate a start condition

    handle->lastStatus = I2C_OK; // Set the last state to OK
    return I2C_OK; // Return success status (actual write implementation is not provided)
}

/// @brief Read data from an I2C device.
/// @param handle Pointer to the I2C handle structure.
/// @param deviceAddress The I2C address of the device to read from.
/// @param data Pointer to the buffer to store the read data.
/// @param length The number of bytes to read from the device.
/// @return I2C status indicating success or failure.  The provided handle will be updated
/// with the read data if the function returns I2C_STATUS_SUCCESS.  If the function returns
/// I2C_STATUS_ERROR, the handle will not be updated and should not be used.
I2C_Status_t I2C_Read(I2C_Handle_t* handle, uint16_t deviceAddress, uint8_t* data, uint16_t length)
{
    if (!isHandleValid(handle))
    {
        return I2C_INVALID_HANDLE; // Return an error code indicating that the handle is invalid
    }
    I2C_Status_t status = I2C_OK;
    if ((status = I2C_IsBusy(handle)) != I2C_OK)
    {
        return status;
    }
    if (length <= 0)
    {
        handle->lastStatus = I2C_INVALID_LENGTH; // Set the last state to invalid length
        return I2C_INVALID_LENGTH; // Return an error code indicating that the length is invalid
    }
    cacheHandle(handle);
    handle->activeDeviceAddress = deviceAddress;

    handle->rxBuffer = data;       // Set the receive buffer pointer
    handle->rxBufferSize = length; // Set the receive buffer size
    handle->rxBufferIndex = 0;     // Reset the receive buffer index

    setupDeviceAddress(handle, deviceAddress, true); // Setup the device address for read operation
    PIE7bits.I2C1TXIE = 0;                           // RX transfer only
    PIE7bits.I2C1RXIE = 1;                           // Enable the receive interrupt
    handle->state = I2C_READ;                        // Set the I2C bus state to read mode
    I2C1CNT = (uint8_t)length; // Set the I2C count register to the number of bytes to receive
    I2C1CON0bits.RSEN = 0;     // Disable repeated start condition
    I2C1CON0bits.CSTR = 0;     // Release clock stretching before starting the transfer
    I2C1CON0bits.S = 1;        // Generate a start condition

    handle->lastStatus = I2C_OK; // Set the last state to OK
    return I2C_OK; // Return success status (actual read implementation is not provided)
}

/// @brief Read data from a specific register of an I2C device.  This function is used to read
/// data from a specific register of an I2C device.  The function must first write the register
/// address as a single byte to the define (with the address of the device and the r/w bit cleared).
/// It then generates a repeated start condition and reads the specified number of bytes from the
/// device.
/// @param handle Pointer to the I2C handle structure.
/// @param deviceAddress The I2C address of the device to read from.
/// @param registerAddress The register address to read from.
/// @param data Pointer to the buffer to store the read data.
/// @param length The number of bytes to read from the device.
/// @return I2C status indicating success or failure.  The provided handle will be updated
/// with the read data if the function returns I2C_OK.
I2C_Status_t I2C_ReadRegister(I2C_Handle_t* handle, uint16_t deviceAddress, uint8_t registerAddress,
                              uint8_t* data, uint16_t length)
{
    if (!isHandleValid(handle))
    {
        return I2C_INVALID_HANDLE; // Return an error code indicating that the handle is invalid
    }
    I2C_Status_t status;
    if ((status = I2C_IsBusy(handle)) != I2C_OK)
    {
        return status;
    }
    if (length <= 0)
    {
        handle->lastStatus = I2C_INVALID_LENGTH; // Set the last state to invalid length
        return I2C_INVALID_LENGTH; // Return an error code indicating that the length is invalid
    }

    cacheHandle(handle);
    handle->activeDeviceAddress = deviceAddress;
    handle->lastStatus = I2C_OK;

    // Prepare receive context for the second phase (read after repeated-start).
    handle->rxBuffer = data;
    handle->rxBufferSize = length;
    handle->rxBufferIndex = 0;

