dewayne57/PIC18F__Q43/03 I2C/I2C 02 Module Host/i2c.c
    // Phase 1: address + write + one register byte.
    // Phase 2 (repeated-start + read) is initiated by the I2C general ISR
    // when the hardware byte count reaches zero.
    handle->registerAddressByte = registerAddress;
    handle->txBuffer = &handle->registerAddressByte;
    handle->txBufferSize = 1;
    handle->txBufferIndex = 1;

    setupDeviceAddress(handle, deviceAddress, false);
    PIE7bits.I2C1TXIE = 1;
    PIE7bits.I2C1RXIE = 0;
    handle->state = I2C_READ_REGISTER;
    I2C1CNT = 1;
    I2C1TXB = handle->registerAddressByte;
    I2C1CON0bits.RSEN = 0;
    I2C1CON0bits.CSTR = 0;
    I2C1CON0bits.S = 1;

    handle->lastStatus = I2C_OK;
    return I2C_OK;
}

/// @brief Reset the I2C module.  This function resets the I2C module by clearing all interrupts
/// and resetting any operations in progress.  The function is defined as follows:
I2C_Status_t I2C_Reset(I2C_Handle_t* handle)
{
    if (!isHandleValid(handle))
    {
        return I2C_INVALID_HANDLE; // Return an error code indicating that the handle is invalid
    }
    cacheHandle(handle);

    // Reset the I2C module based on the channel
    CRITICAL_SECTION_START();
    PIE7bits.I2C1TXIE = 0; // Stop byte-pacing interrupts during reset
    PIE7bits.I2C1RXIE = 0;
    I2C1CON0bits.CSTR = 0; // Release clock stretching if active
    I2C1CON0bits.RSEN = 0; // Cancel any repeated-start request
    I2C1CON0bits.S = 0;    // Clear the start condition bit
    I2C1CON0bits.EN = 0;   // Disable the I2C module
    PIR7bits.I2C1EIF = 0;  // Clear the I2C1 error interrupt flag
    PIR7bits.I2C1IF = 0;   // Clear the I2C1 general interrupt flag
    PIR7bits.I2C1TXIF = 0; // Clear the I2C1 transmit interrupt flag
    PIR7bits.I2C1RXIF = 0; // Clear the I2C1 receive interrupt flag
    I2C1PIR = 0;           // Clear I2C1 interrupt flags
    I2C1ERR = 0;           // Clear I2C1 error flags
    I2C1CNT = 0;           // Reset I2C1 count register
    I2C1CON0bits.EN = 1;   // Re-enable module so future transactions can run

    PIE7bits.I2C1EIE = 1; // Restore base interrupt gates; TX/RX are enabled per transfer.
    PIE7bits.I2C1IE = 1;
    PIE7bits.I2C1TXIE = 0;
    PIE7bits.I2C1RXIE = 0;

    handle->state = I2C_IDLE;    // Set the I2C bus state to idle
    handle->lastStatus = I2C_OK; // Set the last state to OK
    CRITICAL_SECTION_END();
    return I2C_OK;

    return I2C_INVALID_CHANNEL;
}

/// @brief Check if the I2C bus is busy.  This function checks the state of the I2C bus and
/// returns an error code indicating whether the bus is busy or idle.  Thefunction checks
/// the i2c count and status register bits to determine if its idle or not.
I2C_Status_t I2C_IsBusy(I2C_Handle_t* handle)
{
    if (!isHandleValid(handle))
    {
        return I2C_INVALID_HANDLE; // Return an error code indicating that the handle is invalid
    }
    cacheHandle(handle);

    if (I2C1STAT0bits.BFRE)
    {
        return I2C_OK; // Bus is free
    }

    return I2C_BUSY; // Bus is busy
}

/// @brief Validate the I2C handle structure.  This function checks the signature of the
/// I2C handle structure to ensure that it is valid.  The function returns true if
/// the handle is valid, and false if the handle is invalid.  The function is defined as
/// follows:
static bool isHandleValid(I2C_Handle_t* handle)
{
    if (handle == NULL)
    {
        return false; // Handle is NULL, not valid
    }
    if (handle->signature != I2C_HANDLE_SIGNATURE)
    {
        return false; // Handle signature does not match, not valid
    }
    return true; // Handle is valid
}

/// @brief Setup the I2C device address for read or write operation.  This function sets
/// the I2C device address in the appropriate register based on the I2C channel and the
/// read/write operation.
/// @param handle Pointer to the I2C handle structure.
/// @param deviceAddress The I2C address of the device to communicate with.
/// @param read Boolean flag indicating whether the operation is a read (true) or write (false).
/// @return None
static void setupDeviceAddress(I2C_Handle_t* handle, uint16_t deviceAddress, bool read)
{
    uint8_t addressHigh = (deviceAddress >> 8) & 0x03; // Get the upper 2 bits for 10-bit addressing
    addressHigh |= 0xF0;                       // Set the upper 4 bits to 1 for 10-bit addressing
    uint8_t addressLow = deviceAddress & 0xFF; // Get the lower 8 bits for 10-bit addressing
    if (read)
    {
        addressLow |= 0x01; // Set the read/write bit for read operation
    }
    else
    {
        addressLow &= ~0x01; // Clear the read/write bit for write operation
    }

    switch (handle->mode)
    {
    case I2C_MODE_MASTER_7:
    case I2C_MULTI_MASTER_7:
        I2C1ADB1 = addressLow; // Set the 7-bit address in the ADB1 register
        break;
    case I2C_MODE_MASTER_10:
    case I2C_MULTI_MASTER_10:
        I2C1ADB1 = addressLow;  // Set the lower 8 bits for 10-bit addressing
        I2C1ADB0 = addressHigh; // Set the upper 2 bits for 10-bit addressing
        break;
    default:
        handle->lastStatus = I2C_INVALID_MODE; // Set the last state to invalid mode
        return;                                // Invalid mode, exit the function
    }
}

/// @brief Handle I2C error interrupts.  This function checks the I2C error interrupt flags
/// and updates the I2C handle structure with the appropriate error state.
/// @param handle Pointer to the I2C handle structure.
/// @return None
static void handleErrorInterrupt(I2C_Handle_t* handle)
{
    if (!isHandleValid(handle))
    {
        return; // Handle is NULL, exit the function
    }

    // Check for bus timeout error
    if (I2C1ERRbits.BTOIF)
    {
        I2C1ERRbits.BTOIF = 0;                // Clear the bus timeout interrupt flag
        handle->lastStatus = I2C_BUS_TIMEOUT; // Set the last state to bus timeout
        handle->state = I2C_IDLE;             // Set the I2C bus state to idle
    }

    // Check for bus collision error
    if (I2C1ERRbits.BCLIF)
    {
        I2C1ERRbits.BCLIF = 0;                  // Clear the bus collision interrupt flag
        handle->lastStatus = I2C_BUS_COLLISION; // Set the last state to bus collision
        handle->state = I2C_IDLE;               // Set the I2C bus state to idle
    }

    // Check for NACK received error
    if (I2C1ERRbits.NACKIF)
    {
        I2C1ERRbits.NACKIF = 0;                               // Clear the NACK interrupt flag
        handle->lastStatus = (I2C_Status_t)I2C_NACK_RECEIVED; // Set the last state to NACK received
        handle->state = I2C_IDLE;                             // Set the I2C bus state to idle
    }
}

/// @brief Handle I2C general interrupts. We are using this interrupt to trigger the
/// repeated-start read phase after the 1-byte register-address write phase completes.
/// This is done by checking if the I2C count register has reached zero and if the handle
/// state is in read-register mode.  If both conditions are met, we set up the device
/// address for reading and transition to read mode.
/// @param handle Pointer to the I2C handle structure.
/// @return None
static void handleGeneralInterrupt(I2C_Handle_t* handle)
{
    if (!isHandleValid(handle))
    {
        return; // Handle is NULL, exit the function
    }

    // If it is the count interrupt, we need to check if we are in read-register mode
    //  and transition to read mod after a restart.
    if (I2C1PIRbits.I2C1IF)
    {
        I2C1PIRbits.I2C1IF = 0; // Clear the general interrupt flag
        // After the 1-byte register-address write phase, CNT reaches zero.
        // Trigger the repeated-start read phase here instead of depending on TXIF timing.
        if (handle->state == I2C_READ_REGISTER)
        {
            setupDeviceAddress(handle, handle->activeDeviceAddress, true);
            handle->state = I2C_READ;
            PIE7bits.I2C1TXIE = 0; // Disable the transmit interrupt
            PIE7bits.I2C1RXIE = 1; // Enable the receive interrupt
            I2C1CNT =
                (uint8_t)handle
                    ->rxBufferSize; // Set the I2C count register to the number of bytes to receive
            I2C1CON0bits.RSEN = 1;  // Enable repeated start condition
            I2C1CON0bits.CSTR = 0;  // Release clock stretching before starting the transfer
            I2C1CON0bits.S = 1;     // Generate a start condition
        }
    }
}

/// @brief Handle I2C receive interrupts.  This function reads the received data from the
/// I2C receive buffer and stores it in the I2C handle structure.
/// @param handle Pointer to the I2C handle structure.
/// @return None
void handleReceiveInterrupt(I2C_Handle_t* handle)
{
    if (!isHandleValid(handle))
    {
        return; // Handle is NULL, exit the function
    }

    uint8_t data = I2C1RXB; // Read the receive buffer to clear the interrupt flag
    if (handle->state != I2C_READ)
    {
        return; // Not in read mode, exit the ISR
    }

    if (handle->rxBufferIndex < handle->rxBufferSize)
    {
        handle->rxBuffer[handle->rxBufferIndex++] = data;
        if (handle->rxBufferIndex >= handle->rxBufferSize)
        {
            handle->state = I2C_IDLE;
            PIE7bits.I2C1RXIE = 0;
        }
    }
    else
    {
        handle->state = I2C_IDLE;
        PIE7bits.I2C1RXIE = 0;
    }
}

